

# tap setup
tap "buo/cask-upgrade"
tap "homebrew/core" # errored out last time
tap "homebrew/bundle"
tap "homebrew/cask"
tap "buo/cask-upgrade"
tap "homebrew/cask-fonts"
# from my old mbp
tap "cloudflare/cloudflare"
tap "homebrew/bundle"
tap "homebrew/services"
tap "superfly/tap"
tap "romkatv/powerlevel10k"
# Casks
## todo firefox dev dev edition
#  https://stackoverflow.com/questions/71283020/how-to-install-firefox-developer-edition-via-homebrew
cask 'google-chrome'
cask 'dropbox'
# cask 'alfred' current version if 5, I use 4
# cask 'slack' installed by Jampf
cask 'spotify'
cask 'kindle'
cask "obs" ## screen-recorder
cask "visual-studio-code"
cask "firefox"
cask "discord"

# System
brew "zsh-completions"
brew "zsh-syntax-highlighting"
brew "mas"
brew "curl"
brew "wget"
brew "git"
brew "rsync"
brew "romkatv/powerlevel10k/powerlevel10k"

# Misc
brew "lastpass-cli"

# Ops
brew "awscli"
brew "cloudflare/cloudflare/cloudflared"
# JSON
brew "jq"

#Dev
brew "yarn"
brew "pyenv"
cask "postman"
